Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/care_in_your_community/community_care_services.html.txt.tmx
Source language: en
Languages: ga

source: Public health services provided in the community in Ireland are sometimes referred to as community care services
ga: Tagraítear ó thráth go chéile do sheirbhísí sláinte pobail a sholáthraítear ag leibhéal an phobail in Éirinn mar 'Sheirbhísí Cúraim Phobail'

source: They are generally provided by the Health Service Executive (HSE)
ga: Is iondúil gurb é Feidhmeannacht na Seirbhíse Sláinte (FSS) a sholáthraíonn iad

source: Community care services may also be provided by voluntary organisations in conjunction with, or on behalf of, the HSE
ga: Féadann eagrais deonacha seirbhísí cúraim phobail a sholáthar i gcomhar leis, nó ar son an FSS faoi leith

source: There is a wide variation in the level of services available in different parts of the country
ga: Tá éagsúlacht leathan ann i leibhéal na seirbhísí a bhíonn ar fáil i gceantair éagsúla den tír

source: In general, medical card holders are entitled to community care services free of charge
ga: Go ginearálta bíonn sealbhóirí chárta leighis dteideal seirbhísí cúraim phobail a fháil saor in aisce

source: Non-medical card holders may also be entitled but it is not always possible to actually get the services
ga: Féadann daoine eile a bheith ina dteideal, ach ní i gcónaí ar féidir na seirbhísí a fháil

source: What are community care services?
ga: Cad is seirbhísí cúraim phobail ann?

source: Community care services can include public health nursing, home help, physiotherapy, occupational therapy, chiropody, day care and respite care
ga: Féadtar an tseirbhís altranais sláinte phoiblí, an tseirbhís cúnaimh bhaile, fisiteiripe, teiripe saothair, seirbhís cosliachta, cúram lae, seirbhís cúraim fhaoisimh, srl

source: The rules about which community care services must be provided vary for the different services
ga: Bíonn difríocht idir na rialacha maidir leis na seirbhísí cúraim phobail nach foláir a sholáthar de réir na seirbhísí éagsúla

source: In some cases, the HSE is obliged to provide services while, in others, the HSE has discretion about whether to make the service available or not
ga: I roinnt cásanna, ní mór do Feidhmeannacht na Seirbhíse Sláinte seirbhísí a sholáthar; agus i gcásanna eile, bíonn rogha ag an FSS an tseirbhís a chur ar fáil nó gan í a chur ar fáil

source: The HSE is obliged to provide a free nursing service to medical card holders
ga: Ní foláir do Feidhmeannacht na Seirbhíse Sláinte seirbhís altranais a sholáthar saor in aisce do gach sealbhóir chárta leighis

source: The service is not necessarily confined to medical card holders, although they get priority as they have a legal entitlement
ga: Ní gá go mbíonn an tseirbhís teoranta do shealbhóirí chárta leighis, cé go bhfaigheann siadsan tosaíocht óir teidlíocht dhlíthiúil a bheith acu

source: Public health nurses supply many basic nursing and medical needs and a number of special services are provided in some community care areas
ga: Soláthraíonn na haltraí sláinte phoiblí go leor de na riachtanais bhunúsacha altranais agus leighis, agus soláthraítear roinnt seirbhísí speisialta i roinnt limistéar cúraim phobail

source: These include night nursing, day nursing, weekend nursing and twilight nursing
ga: Áirítear leo seo an t-altranas istoíche, altranas lae, altranas ag an deireadh seachtaine agus altranas clapsholais

source: The services provided by the public health nurses vary from area to area and they often act as a point of access for other community care services
ga: Bíonn éagsúlacht idir na seirbhísí a sholáthraíonn na haltraí sláinte phoiblí ó cheantar go chéile, agus is minic iad mar phointe rochtana do sheirbhísí cúraim phobail eile

source: Some Local Health Offices employ care assistants as a back-up to the public health nursing service
ga: Fostaíonn roinnt Oifigí Sláinte Áitiúil cúntóirí cúraim mar thaca don tseirbhís altranais sláinte phoiblí

source: The role of the care assistant is to provide personal care rather than domestic services, but there is some overlap between what they do and what home helps do
ga: Is é an ról atá acu ná cúram pearsanta a sholáthar seachas seirbhísí baile, ach bíonn forluí ann idir cuid dá gcúraim agus cúraim na gcúntóirí baile

source: The Health Service Executive may make arrangements (but is not obliged to do so) to help maintain at home people who are sick or infirm
ga: Féadann Feidhmeannacht na Seirbhíse Sláinte socruithe a dhéanamh (ach ní chaithfidh siad) chun cabhrú le cothabháil na ndaoine tinne nó easlána ag a mbaile

source: They may also make arrangements for people who would otherwise need institutional care
ga: Féadann siad socruithe a dhéanamh freisin do dhaoine óna theastódh cúram institiúide seachas sin

source: The usual way they do this is by providing a home help service
ga: Is é an gnáthbhealach chuige sin ná seirbhís cúnaimh bhaile a sholáthar

source: Home helps may be employed either by the HSE or by voluntary organisations
ga: Féadann Feidhmeannacht na Seirbhíse Sláinte (FSS) nó eagrais deonacha cúntóirí bailea fhostú

source: They usually help with normal household tasks although they may also help with personal care
ga: Is iondúil go gcabhraíonn siad leis na gnáthchúraim baile, cé gur féidir leo cabhrú le cúram pearsanta fosta

source: If you get a home help, you may have to make a contribution towards the cost, but this practice varies greatly from area to area
ga: Má fhaigheann tú cúntóir baile, b’fhéidir go mbeadh ort cuid den costas a íoc, ach athraíonn an cleachtas sin ó cheantar go chéile

source: Some Local Health Offices also provide a limited home help respite service for carers
ga: Soláthraíonn roinnt Oifigí Sláinte Áitiúil seirbhís fhaoisimh theoranta cúnaimh bhaile do chúramóirí

source: Physiotherapy services are generally provided in the community and are generally free to medical card holders
ga: Is sa phobal a sholáthraítear seirbhísí fisiteiripe go ginearálta, agus is iondúil iad a bheith saor in aisce do shealbhóirí chárta leighis

source: Waiting lists operate in many areas
ga: Bíonn liostaí feithimh i bhfeidhm i go leor ceantar

source: Home services are only available in a small number of cases
ga: Ní bhíonn seirbhísí baile ar fáil ach i líon beag cásanna

source: Occupational Therapists are employed by most Local Health Offices
ga: Fostaíonn an chuid is mó d'Oifigí Sláinte Áitiúil teiripeoirí saothair

source: Their services are generally available free to medical card holders
ga: Bíonn a gcuid seirbhísí ar fáil saor in aisce do shealbhóirí chárta leighis de ghnáth

source: Waiting lists operate in most community care areas for these services
ga: Bíonn liostaí feithimh i bhfeidhm sa chuid is mó de na limistéir chúraim phobail do na seirbhísí sin

source: Chiropody services are available free to medical card holders in most community care areas
ga: Bíonn seirbhísí cosliachtaar fáil saor in aisce do shealbhóirí chárta leighis sa chuid is mó de na limistéir chúraim phobail

source: The HSE provides medical and surgical aids and appliances, such as wheelchairs and walking aids, free of charge to medical card holders and people on the Long Term Illness Scheme
ga: Cuireann an FSS áiseanna agus fearais leighis agus máinliachta, ar nós cathaoireacha rotha agus áiseanna siúil, a sholáthar saor in aisce do shealbhóirí chárta leighis agus do dhaoine atá ar an Scéim Tinneas Fadtéarmach

source: If you do not have a medical card, you may get such aids and appliances free if they are part of hospital treatment
ga: Mura bhfuil cárta leighis agat, féadann tú na háiseanna agus fearais sin a fháil saor in aisce más cuid de chóireáil ospidéil iad

source: In practice, in other cases, the HSE may provide some help with the costs
ga: Is amhlaidh i gcleachtadh go bhféadann na Limistéir FSS roinnt cabhrach le costais a chur ar fáil i gcásanna eile

source: If you have private health insurance, you may be covered for some or all of the costs
ga: Má tá árachas sláinte príobháideach agat, d'fhéadfaí go gcumhdófaí tú do chuid nó d’iomlán na gcostas

source: Respite care or temporary care may be based in the community or in an institution
ga: Féadann an cúram faoisimh a bheith bunaithe sa phobal nó in institiúid

source: In practice, respite care is provided to a varying degree at a number of locations around the country – in some cases by HSE and in others by voluntary organisations
ga: Is amhlaidh i gcleachtadh go soláthraítear an cúram faoisimh do chéim athraitheach ag roinnt ionad ar fud na tíre – sa FSS i roinnt cásanna agus ag eagrais deonacha i gcásanna eile

source: Day centres include centres that provide day activities such as recreational, sport and leisure facilities and specialised clinic facilities that provide a combination of medical and vocational rehabilitation services
ga: Áirítear leis na hionaid lae na hionaid a sholáthraíonn gníomhaíochtaí lae ar nós na n-áiseanna caithimh aimsire, spóirt agus fóillíochta agus na n-áiseanna sainchlinice a sholáthraíonn teaglaim de sheirbhísí athshlánaithe leighis agus gairme

source: Day centres are provided on a variable basis throughout the country, some being funded by the HSE and others funded by voluntary organisations
ga: Soláthraítear ionaid lae ar bhonn athraitheach ar fud na tíre, roinnt acu arna maoiniú ag an bhFeidhmeannacht na Seirbhíse Sláinte agus cinn eile arna maoiniú ag eagrais deonacha

source: Day centres providing medical care are less widely available and are funded by the HSE
ga: Ní bhíonn na hionaid lae a sholáthraíonn cúram leighis chomh forleathan céanna, agus is é an FSS a mhaoiníonn iad

source: Access to day centres is by referral and the eligibility conditions vary from area to area with means tests applying in some cases
ga: Is trí tharchur a fhaightear rochtain ar na hionaid lae, agus bíonn na coinníollacha incháilitheachta éagsúil ó cheantar go ceantar, rud a chiallaíonn go mbíonn tástálacha i bhfeidhm i roinnt cásanna

source: Meals services are provided by voluntary and statutory bodies
ga: Is meascán de chomhlachtaí deonacha agus reachtúla a sholáthraíonn na seirbhísí béilí go ginearálta

source: The ways in which these are provided vary from area to area
ga: Bíonn na slite ina soláthraítear iad seo éagsúil ó cheantar go ceantar

source: Access to meals services is generally by referral
ga: Is trí tharchur a fhaightear rochtain ar sheirbhísí béilí de ghnáth

source: You may be asked to contribute towards the cost of meals services
ga: D’fhéadfaí go n-iarrfaí ort cuid de chostas na seirbhísí béilí a chlúdú

source: Eligibility conditions vary from area to area
ga: Bíonn na coinníollacha incháilitheachta éagsúil ó cheantar amháin go chéile

source: Transport services are provided by the HSE on a varying basis throughout the country
ga: Soláthraíonn an FSS seirbhísí iompair ar bhonn athraitheach ar fud na tíre

source: These services include access to day hospitals and day centres and access to outpatient departments and other hospital services
ga: Áirítear leis na seirbhísí seo rochtain ar ospidéil lae agus ar ionaid lae, agus rochtain ar rannóga na n-othar seachtrach agus ar sheirbhísí ospidéil eile

source: Other community care services include social workers, speech therapists and dietitians
ga: Áirítear leis na seirbhísí cúraim phobail eile oibrithe, teiripeoirí urlabhra agus bia-eolaithe

source: Initially, you should ask your GP about community care services in your area or contact your Local Health Office
ga: Ba chóir duit é a fhiafraí de do dhochtúir teaghlaigh ar dtús, nó a dhul i dteagmháil le Oifig Sláinte Áitiúil
